CSI API ETABS v1

# cCaseStaticNonlinearSetMassSource Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetMassSource(
    	string Name,
    	string mSource
    )

    Function SetMassSource (
    	Name As String,
    	mSource As String
    ) As Integer

    Dim instance As cCaseStaticNonlinear
    Dim Name As String
    Dim mSource As String
    Dim returnValue As Integer

    returnValue = instance.SetMassSource(Name,
    	mSource)

    int SetMassSource(
    	String^ Name,
    	String^ mSource
    )

    abstract SetMassSource :
            Name : string *
            mSource : string -> int

#### Parameters

Name

    Type: SystemString

mSource

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinear Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com